Repository: ismatullayevs/anormatch-bot
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: uz

source: Open chat
uz: Chatga kirish

source: You have a new message from {name}
uz: Sizga {name}dan yangi xabar keldi

source: ❌ Clear
uz: ❌ Tozalash

source: Male 👨
uz: Erkak 👨

source: Female 👩
uz: Ayol 👩

source: Women 👩
uz: Qizlar 👩

source: Men 👨
uz: Yigitlar 👨

source: 🔎 Watch profiles
uz: 🔎 Profillarni ko'rish

source: 👍 Likes
uz: 👍 Yoqtirishlar

source: ❤️ Matches
uz: ❤️ Mosliklar

source: ⚙️ Settings
uz: ⚙️ Sozlamalar

source: ✍️ Report
uz: ✍️ Shikoyat qilish

source: ⬅️ Menu
uz: ⬅️ Menyu

source: 👤 My profile
uz: 👤 Mening profilim

source: 🔎 Search settings
uz: 🔎 Qidiruv sozlamalari

source: 🌐 Language
uz: 🌐 Til

source: ⛔️ Deactivate
uz: ⛔️ To'xtatish

source: ❌ Delete account
uz: ❌ Akkountni o'chirish

source: ⏪ Rewind
uz: ⏪ Orqaga

source: 📍 Send location
uz: 📍 Lokatsiya jo'natish

source: City name
uz: Shahar nomi

source: ✏️ Name
uz: ✏️ Ism

source: 🔢 Birth date
uz: 🔢 Tug'ilgan sana

source: 👫 Gender
uz: 👫 Jins

source: 📍 Location
uz: 📍 Joylashuv

source: ⬅️ Back
uz: ⬅️ Orqaga

source: 👩‍❤️‍👨 Gender preferences
uz: 👩‍❤️‍👨 Yoqtirilgan jins

source: 🔢 Age preferences
uz: 🔢 Yosh chegarasi

source: Hi! Select a language
uz: Salom! Tilni tanlang

source: Unknown command. Please use /start to start the bot.
uz: Noma'lum buyruq. Botni ishga tushirish uchun /start ni bosing.

source: No likes found
uz: Yoqtirishlar topilmadi

source: Likes
uz: Yoqtirishlar

source: No matches found
uz: Hech kim topilmadi

source: You both liked each other. Start a chat with them by clicking the button below 👇
uz: Siz bir-biringizni yoqtirdingiz. Pastdagi tugmani bosib, suhbatni boshlang 👇

source: Start a chat
uz: Suhbatni boshlash

source: Matches
uz: Mosliklar

source: Menu
uz: Menyu

source: What's the reason for reporting this user?
uz: Shikoyat sababi nima?

source: User has been reported
uz: Shikoyat yuborildi

source: Settings
uz: Sozlamalar

source: Are you sure you want to deactivate your account? No one will see your account, even the users that you liked
uz: Ishonchingiz komilmi? Hech kim sizning profilingizni ko'rolmaydi, hatto siz yoqtirgan foydalanuvchilar ham

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Activate my account
uz: Akkountimni faollashtirish

source: Your account has been activated
uz: Akkountingiz faollashtirildi

source: Your account has been deactivated. To activate it, press the button below
uz: Akkountingiz to'xtatildi. Uni faollashtirish uchun, pastdagi tugmani bosing

source: Choose your language
uz: Tilni tanlang

source: Are you sure you want to delete your account? All your data will be lost
uz: Ishonchingiz komilmi? Barcha ma'lumotlaringiz o'chiriladi

source: Your account has been deleted. To start again, press the button below
uz: Akkountingiz o'chirildi. Qaytadan boshlash uchun, pastdagi tugmani bosing

source: Start registration
uz: Registratsiyani boshlash

source: Press the buttons below to update your profile
uz: Profilingizni o'zgartirish uchun pastdagi tugmalardan birini bosing

source: Search settings
uz: Qidiruv sozlamari

source: Enter your name
uz: Ismingizni yozing

source: Your profile has been updated
uz: Profilingiz yangilandi

source: What's your birth date? Use one these formats: 👉 <b>YYYY-MM-DD</b> (For example, 2000-12-31) 👉 <b>DD.MM.YYYY</b> (For example, 31.12.2000) 👉 <b>MM/DD/YYYY</b> (For example, 12/31/2000)
uz: Tug'ilgan kuningiz qachon? Quyidagi formatlarning biridan foydalaning: 👉 <b>YYYY-OO-KK</b> (Masalan, 2000-12-31) 👉 <b>KK.OO.YYYY</b> (Masalan, 31.12.2000) 👉 <b>OO/KK/YYYY</b> (Masalan, 12/31/2000)

source: Select your gender
uz: Jinsni tanlang

source: Tell me more about yourself. What are your hobbies, interests, etc.?
uz: O'zingiz haqingizda aytib bering (qiziqishlaringiz, hobbilaringiz, ...)

source: Who are you interested in?
uz: Sizga kimlar yoqadi?

source: Search settings have been updated
uz: Qidiruv sozlamalari yangilandi

source: What is your preferred age range? (e.g. 18-25)
uz: Yosh chegarasini belgilang. Masalan: 18-25

source: Share your location or type the name of your city
uz: Lokatsiya jo'nating yoki shahar nomini yozing

source: City not found
uz: Shahar topilmadi

source: Select your city
uz: Shahringizni tanlang

source: Upload photos or videos of yourself ({min_media_count}-{max_media_count})
uz: Rasm va videolaringizni jo'nating (1-5)

source: Continue
uz: Davom ettirish

source: Please upload at least one photo
uz: Iltimos, kamida 1 ta rasm joylashtiring

source: File has been uploaded
uz: Fayl joylashtirildi

source: File has been uploaded. Upload more media files if you want or press "Continue"
uz: Fayl joylashtirildi. Ko'proq fayl jo'nating yoki "Davom ettirish" tugmasini bosing

source: Hi there! I'm a bot to help you find your soulmate. Here's how it works: you'll be shown profiles of other users, and you can like or dislike them. When you like a profile, we will notify the user about it. If the user likes you back, you'll be matched and can start chatting. If you have any questions, contact our <a href='{support_link}'>support team</a>.
uz: Salom! Men sizga juftingizni topishga yordam beraman. Bot qanday ishlaydi: biz sizga boshqa foydalanuvchilar profilini ko'rsatamiz. Siz ularga layk yoki dislayk bosishingiz mumkin. Siz kimningdir profiliga layk bossangiz, biz foydalanuvchini bu haqida ogohlantiramiz. Agar foydalanuvchi ham sizga layk bossa, siz ular bilan suhbatlashishingiz mumkin bo'ladi. Agar savollaringiz bo'lsa, bizning <a href='{support_link}'>qo'llab-quvvatlash bo'limimizga</a> yozing.

source: Your account is banned. Please contact support.
uz: Akkountingiz taqiqlangan. Iltimos, qo'llab-quvvatlash markazimizga murojaat qiling.

source: Select one of the given languages
uz: Berilgan tillardan birini tanlang

source: What is your name?
uz: Ismingiz nima?

source: What is your gender?
uz: Jinsingiz?

source: Select one of the given options
uz: Berilgan variantlardan birini tanlang

source: Skip
uz: O'tkazib yuborish

source: Share your location by clicking the button below
uz: Pastdagi tugmani bosish orqali lokatsiyangizni jo'nating

source: Registration has been completed!
uz: Registratsiya yakunlandi!

source: No one left to match with right now.
uz: Boshqa mos keladigan foydalanuvchi topilmadi.

source: You can't rewind more than {rewind_limit} times
uz: {rewind_limit} martadan ko'p ortga qaytarish mumkin emas

source: No more matches to rewind
uz: Boshqa ortga qaytarib bo'lmaydi

source: ⏪ Rewinding
uz: ⏪ Orqaga

source: User not found
uz: Foydalanuvchi topilmadi

source: Congratulations 🎉. You have matched with {match.name}. Start a chat with them by clicking the button below 👇
uz: Tabriklaymiz 🎉. Siz {match.name} bilan mos keldingiz. Pastdagi tugmani bosib, suhbatni boshlang 👇

source: Someone liked your profile. Do you want to see who liked you?
uz: Kimdir sizning profilingizni yoqtirdi. Kimlar sizni yoqtirganini ko'rishni xohlaysizmi?

source: Name must only contain letters and spaces
uz: Ism faqat harflardan tashkil topgan bo'lishi kerak

source: Name must be at least {min_length} characters long
uz: Ism kamida {min_length} harfdan tashkil topgan bo'lishi kerak

source: Name must be less than {max_length} characters long
uz: Ism uzunligi {max_length} dan kam bo'lishi kerak

source: Invalid date format. Supported formats are: - YYYY-MM-DD (1970-10-20), - DD.MM.YYYY (20.10.1970), - MM/DD/YYYY (10/20/1970)
uz: Sanani noto'g'ri formatda kiritdingiz. Quyidagi formatlardan foydalaning: - YYYY-OO-KK (1970-10-20), - KK.OO.YYYY (20.10.1970), - OO/KK/YYYY (10/20/1970)

source: You must be at least {min_age} years old to use this bot
uz: Botdan foydalanish uchun kamida {min_age} yoshda bo'lishingiz kerak

source: You must be less than {max_age} years old to use this bot
uz: Botdan foydalanish uchun {max_age} yoshdan kichik bo'lishingiz kerak

source: Bio must be less than {max_length} characters long
uz: Bio uzunligi {max_length} dan kam bo'lishi kerak

source: Please upload at least {min_length} media files
uz: Iltimos, kamida {min_length} ta media fayl jo'nating

source: You can upload up to {max_length} media files
uz: Ko'pi bilan {max_length} ta media fayl joylashtirish mumkin

source: Please enter a valid age range
uz: Iltimos, to'g'ri yosh chegarasini belgilang

source: Age can't be lower than {min_age}
uz: Yosh {min_age} dan kichik bo'lishi mumkin emas

source: Age can't be higher than {max_age}
uz: Yosh {max_age} dan katta bo'lishi mumkin emas

source: Minimum age needs be to lower than maximum age
uz: Minimum yosh maksimum yoshdan kichik bo'lishi kerak

source: Video duration can't be longer than {max_duration} seconds
uz: Video davomiyligi {max_duration} dan uzun bo'lishi mumkin emas

source: Message text cannot be empty
uz: Xabar matni bo'sh bo'lishi mumkin emas

source: Message text must be less than {max_length} characters long
uz: Xabar matni uzunligi {max_length} dan kam bo'lishi kerak
